
#include "test.h"


U8 gaucTask1Stack[TASKSTACK];           /* 任务1的栈 */
U8 gaucTask2Stack[TASKSTACK];           /* 任务2的栈 */
U8 gaucTask3Stack[TASKSTACK];           /* 任务3的栈 */


/***********************************************************************************
函数功能: 测试任务切换函数1, 向内存打印字符串.
入口参数: pvPara: 任务入口参数指针.
返 回 值: none.
***********************************************************************************/
void TEST_TestTask1(void* pvPara)
{
    while(1)
    {
        /* 任务打印 */
        DEV_PutString((U8*)"\r\nTask1 is running!");

        /* 任务运行1秒 */
        DEV_DelayMs(1000);
    }
}

/***********************************************************************************
函数功能: 测试任务切换函数2, 向内存打印字符串.
入口参数: pvPara: 任务入口参数指针.
返 回 值: none.
***********************************************************************************/
void TEST_TestTask2(void* pvPara)
{
    while(1)
    {
        /* 任务打印 */
        DEV_PutString((U8*)"\r\nTask2 is running!");

        /* 任务运行2秒 */
        DEV_DelayMs(2000);
    }
}

/***********************************************************************************
函数功能: 测试任务切换函数3, 向内存打印字符串.
入口参数: pvPara: 任务入口参数指针.
返 回 值: none.
***********************************************************************************/
void TEST_TestTask3(void* pvPara)
{
    while(1)
    {
        /* 任务打印 */
        DEV_PutString((U8*)"\r\nTask3 is running!");

        /* 任务运行3秒 */
        DEV_DelayMs(3000);
    }
}

